---
type: StructuralSectionGeneralR
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 3
tags: [revit-api, class]
---

# StructuralSectionGeneralR

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralR | 2018 | `public StructuralSectionGeneralR ( double diameter , double wallNominalThickness , double wallDesignThickness , double centroidHorizontal , double centroidVertical , StructuralSectionAnalysisParams analysisParams )` |
| Property | WallDesignThickness | 2018 | `public double WallDesignThickness { get ; set ; }` |
| Property | WallNominalThickness | 2018 | `public double WallNominalThickness { get ; set ; }` |